In [2]:
import pymysql
import pandas as pd
myconnection = pymysql.connect(host='127.0.0.1',user='root',passwd='Krisrak@123')
query = "Select * from Dataspark_Global_Electronics.All_Merged_Data;"
df = pd.read_sql(query,myconnection)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\551741965.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query,myconnection)

In [18]:
Gender_Distribution = """SELECT gender, COUNT(*) AS count
FROM dataspark_global_electronics.all_merged_data
GROUP BY gender;"""
df = pd.read_sql(Gender_Distribution,myconnection)
df

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\2550791227.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Gender_Distribution,myconnection)

   gender  count
0    MALE  31804
1  FEMALE  31080

In [20]:
Age_Distribution = """SELECT age, COUNT(*) AS count
FROM dataspark_global_electronics.all_merged_data
GROUP BY age
ORDER BY age;
"""
df = pd.read_sql(Age_Distribution,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\176408593.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Age_Distribution,myconnection)

   age  count
0   22    528
1   23   1190
2   24    945

In [21]:
Location_Distribution = """SELECT country, COUNT(*) AS count
FROM dataspark_global_electronics.all_merged_data
GROUP BY country
ORDER BY count DESC;
"""
df = pd.read_sql(Location_Distribution,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\3491474343.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Location_Distribution,myconnection)

          country  count
0   UNITED STATES  33767
1  UNITED KINGDOM   8140
2         GERMANY   5956

In [23]:
Average_Order_Value = """SELECT AVG(price_usd) AS avg_order_value
FROM dataspark_global_electronics.all_merged_data;
"""
df = pd.read_sql(Average_Order_Value,myconnection)
df

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\1327689681.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Average_Order_Value,myconnection)

   avg_order_value
0       280.569848

In [24]:
Frequency_of_Purchases = """SELECT customerkey, COUNT(order_number) AS purchase_frequency
FROM dataspark_global_electronics.all_merged_data
GROUP BY customerkey
ORDER BY purchase_frequency DESC;
"""
df = pd.read_sql(Frequency_of_Purchases,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\3908854985.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Frequency_of_Purchases,myconnection)

   customerkey  purchase_frequency
0       723572                  36
1      1925694                  32
2      1579183                  32

In [25]:
Preferred_Products = """SELECT product_name, COUNT(*) AS purchase_count
FROM dataspark_global_electronics.all_merged_data
GROUP BY product_name
ORDER BY purchase_count DESC;
"""
df = pd.read_sql(Preferred_Products,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\589460848.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Preferred_Products,myconnection)

                                 product_name  purchase_count
0  ADVENTURE WORKS DESKTOP PC2.30 MD230 BLACK             162
1              WWI DESKTOP PC1.80 E1800 WHITE             158
2              WWI DESKTOP PC1.60 E1600 BLACK             158

In [26]:
age_Segmentation = """SELECT 
  CASE
    WHEN age BETWEEN 18 AND 25 THEN '18-25'
    WHEN age BETWEEN 26 AND 35 THEN '26-35'
    WHEN age BETWEEN 36 AND 45 THEN '36-45'
    WHEN age BETWEEN 46 AND 55 THEN '46-55'
    WHEN age > 55 THEN '55+'
  END AS age_group, 
  COUNT(*) AS count
FROM dataspark_global_electronics.all_merged_data
GROUP BY age_group
ORDER BY count DESC;
"""
df = pd.read_sql(age_Segmentation,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\1930232346.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(age_Segmentation,myconnection)

  age_group  count
0       55+  31202
1     36-45   9405
2     26-35   9301

In [27]:
Total_Sales = """SELECT DATE_FORMAT(order_date, '%Y-%m') AS month, SUM(price_usd) AS total_sales
FROM dataspark_global_electronics.all_merged_data
GROUP BY month
ORDER BY month;
"""
df = pd.read_sql(Total_Sales,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\3668703840.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Total_Sales,myconnection)

     month    total_sales
0  2016-01  201820.149564
1  2016-02  262513.239565
2  2016-03  100640.149788

In [28]:
Top_Performing_Products_Quantity = """SELECT product_name, SUM(quantity) AS total_quantity_sold
FROM dataspark_global_electronics.all_merged_data
GROUP BY product_name
ORDER BY total_quantity_sold DESC
LIMIT 10;
"""
df = pd.read_sql(Top_Performing_Products_Quantity,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\3952421273.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Top_Performing_Products_Quantity,myconnection)

                                 product_name  total_quantity_sold
0              WWI DESKTOP PC2.33 X2330 BLACK                550.0
1              WWI DESKTOP PC1.80 E1800 WHITE                538.0
2  ADVENTURE WORKS DESKTOP PC1.60 ED160 BLACK                521.0

In [29]:
Top_Performing_Products_Revenue = """SELECT product_name, SUM(price_usd) AS total_revenue
FROM dataspark_global_electronics.all_merged_data
GROUP BY product_name
ORDER BY total_revenue DESC
LIMIT 10;
"""
df = pd.read_sql(Top_Performing_Products_Revenue,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\2263297210.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Top_Performing_Products_Revenue,myconnection)

                                  product_name  total_revenue
0   ADVENTURE WORKS DESKTOP PC2.33 XD233 BLACK       146319.0
1               WWI DESKTOP PC2.33 X2330 BLACK       141526.0
2  ADVENTURE WORKS DESKTOP PC2.33 XD233 SILVER       141474.0

In [30]:
Profit_Margins_for_Products = """SELECT product_name, (price_usd - cost_usd) AS profit_margin
FROM dataspark_global_electronics.all_merged_data
ORDER BY profit_margin DESC
LIMIT 10;

"""
df = pd.read_sql(Profit_Margins_for_Products,myconnection)
df.head(3)

C:\Users\rakes\AppData\Local\Temp\ipykernel_19812\2241767224.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(Profit_Margins_for_Products,myconnection)

                                 product_name  profit_margin
0  FABRIKAM REFRIGERATOR 24.7CUFT X9800 GREEN     2139.77002
1     LITWARE REFRIGERATOR 24.7CUFT X980 GREY     2139.77002
2   FABRIKAM REFRIGERATOR 24.7CUFT X9800 GREY     2139.77002